/**
  ******************************************************************************
  * @author  全威智能科技
  * @version V3.0
  * @date    2020-01-09
  * @brief   LTC6903配置C文件
  ******************************************************************************
  * @attention
  *
  * 官网	:
  * 淘宝	:
  * 阿里巴巴:
  ******************************************************************************
  */


#include "74hc595.h"
//#include "main.h"



//------------------------------------------------/
//函数功能:通过SPI写读一字节                    /
//输入参数:oct: 频率范围参数，不同的频率范围有不同的OCT值，/
//					DAC：频率值
///					CNF:0=两个都有输出，相位差180度，
//------------------------------------------------/
void Write595Prg(uint8_t d)
{
    static uint8_t i;
		d<<=1;
    for(i=0; i<8; i++)
    {
        if(d&0x01)
            DATA_ON;
        else
            DATA_OFF;
        Delay1us(10);
        SET_CLK_ON;
        Delay1us(10);
        SET_CLK_OFF;
        d>>=1;
    }
    Delay1ms(1);
    LOCK_CLK_ON;
    Delay1ms(1);
    LOCK_CLK_OFF;
}

