/**
  ******************************************************************************
  * @author  全威智能科技
  * @version V3.0
  * @date    2020-01-09
  * @brief   LTC6903配置C文件
  ******************************************************************************
  * @attention
  *
  * 官网	:	
  * 淘宝	:	
  * 阿里巴巴:	
  ******************************************************************************
  */


#include "74hc238.h"
//#include "main.h"



//------------------------------------------------/
//函数功能:通过SPI写读一字节           
///
//------------------------------------------------/
void Write238Prg(uint8_t d,uint8_t sw)
{
	static uint16_t c;
	static uint8_t i;
	c=d;
	for(i=0;i<8;i++)
	{
		if(c&0x01)
			c=i;///获得通道数
		c>>=1;
	}
	if(sw)///使能输出
	{
//		CON_ON;
//		for(i=0;i<8;i++)
//		{
//			if(cc&0x01)
//				A0_ON;
//			else
//				A0_OFF;
//			if(cc&0x02)
//				A1_ON;
//			else
//				A1_OFF;
//			if(cc&0x04)
//				A2_ON;
//			else
//				A2_OFF;
//		}
	}
//	else///关闭输出
//	{
//		CON_OFF;
//	}
}

